OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f1220.h
#define __CONFIG1H              0x300001
#define __CONFIG2L              0x300002
#define __CONFIG2H              0x300003
#define __CONFIG3H              0x300005
#define __CONFIG4L              0x300006
#define __CONFIG5L              0x300008
#define __CONFIG5H              0x300009
#define __CONFIG6L              0x30000A
#define __CONFIG6H              0x30000B
#define __CONFIG7L              0x30000C
#define __CONFIG7H              0x30000D

//----------------------------- CONFIG1H Options -------------------------------

#define _LP_OSC_1H              0xF0    // LP Oscillator.
#define _XT_OSC_1H              0xF1    // XT Oscillator.
#define _HS_OSC_1H              0xF2    // HS Oscillator.
#define _EC_OSC_1H              0xF4    // EC oscillator, CLKO function on RA6.
#define _ECIO_OSC_1H            0xF5    // EC oscillator, port function on RA6.
#define _HSPLL_OSC_1H           0xF6    // HS oscillator, PLL enabled (clock frequency = 4 x FOSC1).
#define _RCIO_OSC_1H            0xF7    // External RC oscillator, port function on RA6.
#define _INTIO2_OSC_1H          0xF8    // Internal RC oscillator, port function on RA6 and port function on RA7.
#define _INTIO1_OSC_1H          0xF9    // Internal RC oscillator, CLKO function on RA6 and port function on RA7.
#define _RC_OSC_1H              0xFC    // External RC oscillator, CLKO function on RA6.
#define _FSCM_OFF_1H            0xBF    // Fail-Safe Clock Monitor disabled.
#define _FSCM_ON_1H             0xFF    // Fail-Safe Clock Monitor enabled.
#define _IESO_OFF_1H            0x7F    // Internal External Switchover mode disabled.
#define _IESO_ON_1H             0xFF    // Internal External Switchover mode enabled.

//----------------------------- CONFIG2L Options -------------------------------

#define _PWRT_ON_2L             0xFE    // PWRT enabled.
#define _PWRT_OFF_2L            0xFF    // PWRT disabled.
#define _BOR_OFF_2L             0xFD    // Brown-out Reset disabled.
#define _BOR_ON_2L              0xFF    // Brown-out Reset enabled.
#define _BORV_45_2L             0xF3    // VBOR set to 4.5V.
#define _BORV_42_2L             0xF7    // VBOR set to 4.2V.
#define _BORV_27_2L             0xFB    // VBOR set to 2.7V.

//----------------------------- CONFIG2H Options -------------------------------

#define _WDT_OFF_2H             0xFE    // WDT disabled (control is placed on the SWDTEN bit).
#define _WDT_ON_2H              0xFF    // WDT enabled.
#define _WDTPS_1_2H             0xE1    // 1:1.
#define _WDTPS_2_2H             0xE3    // 1:2.
#define _WDTPS_4_2H             0xE5    // 1:4.
#define _WDTPS_8_2H             0xE7    // 1:8.
#define _WDTPS_16_2H            0xE9    // 1:16.
#define _WDTPS_32_2H            0xEB    // 1:32.
#define _WDTPS_64_2H            0xED    // 1:64.
#define _WDTPS_128_2H           0xEF    // 1:128.
#define _WDTPS_256_2H           0xF1    // 1:256.
#define _WDTPS_512_2H           0xF3    // 1:512.
#define _WDTPS_1K_2H            0xF5    // 1:1024.
#define _WDTPS_2K_2H            0xF7    // 1:2048.
#define _WDTPS_4K_2H            0xF9    // 1:4096.
#define _WDTPS_8K_2H            0xFB    // 1:8192.
#define _WDTPS_16K_2H           0xFD    // 1:16384.
#define _WDTPS_32K_2H           0xFF    // 1:32768.

//----------------------------- CONFIG3H Options -------------------------------

#define _MCLRE_OFF_3H           0x7F    // RA5 input pin enabled, MCLR disabled.
#define _MCLRE_ON_3H            0xFF    // MCLR pin enabled, RA5 input pin disabled.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVR_OFF_4L            0xFE    // Stack full/underflow will not cause Reset.
#define _STVR_ON_4L             0xFF    // Stack full/underflow will cause Reset.
#define _LVP_OFF_4L             0xFB    // Low-Voltage ICSP disabled.
#define _LVP_ON_4L              0xFF    // Low-Voltage ICSP enabled.
#define _DEBUG_ON_4L            0x7F    // Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 (00200-0007FFh) code-protected.
#define _CP0_OFF_5L             0xFF    // Block 0 (00200-0007FFh) not code-protected.
#define _CP1_ON_5L              0xFD    // Block 1 (000800-000FFFh) code-protected.
#define _CP1_OFF_5L             0xFF    // Block 1 (000800-000FFFh) not code-protected.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot Block (000000-0001FFh) code-protected.
#define _CPB_OFF_5H             0xFF    // Boot Block (000000-0001FFh) not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (00200-000F7Fh) write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (00200-0007FFh) not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (000800-000FFFh) write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (000800-000FFFh) not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers (300000-3000FFh) write-protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers (300000-3000FFh) not write-protected.
#define _WRTB_ON_6H             0xBF    // Boot Block (000000-0001FFh) write-protected.
#define _WRTB_OFF_6H            0xFF    // Boot Block (000000-0001FFh) not write-protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM write-protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM not write-protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 (00200-0007FFh) protected from table reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 (00200-0007FFh) not protected from table reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 (000800-000FFFh) protected from table reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 (000800-000FFFh) not protected from table reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot Block (000000-0001FFh) protected from table reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot Block (000000-0001FFh) not protected from table reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18F1220_H__
